Revit 2026 API
FieldDomainPointsByUV.SetGridCoordinates Method
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetGridCoordinates(
	ICollection<double> uCoordinates,
	ICollection<double> vCoordinates
)
Public Sub SetGridCoordinates (
	uCoordinates As ICollection(Of Double),
	vCoordinates As ICollection(Of Double)
)
public:
void SetGridCoordinates(
	ICollection<double>^ uCoordinates,
	ICollection<double>^ vCoordinates
)
member SetGridCoordinates :
        uCoordinates : ICollection<float> *
        vCoordinates : ICollection<float> -> unit
Parameters
uCoordinates ICollection<Double>
vCoordinates ICollection<Double>
See Also
Reference
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace